CSI API ETABS v1
cDCompColEurocode_4_2004.GetPreference Method
 Retrieves the value of a composite column design preference item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPreference(
	int Item,
	ref double Value
)
Function GetPreference (
	Item As Integer,
	ByRef Value As Double
) As Integer
Dim instance As cDCompColEurocode_4_2004
Dim Item As Integer
Dim Value As Double
Dim returnValue As Integer
returnValue = instance.GetPreference(Item,
	Value)
int GetPreference(
	int Item,
	double% Value
)
abstract GetPreference :
        Item : int *
        Value : float byref -> int
Parameters
Item
Type: System.Int32
 This is an integer between 1 and 24, inclusive, indicating the preference item considered.
Multi-response case design
Country
Combos equation
Reliability class
Framing type
Consider second-order moments
Partial factor for steel, GammaS
Partial factor for concrete, GammaC
Partial factor for modulus of elasticity of concrete, GammaCE
AlphaCC
AlphaCT
Ignore seismic code
Pattern live load factor
Demand/capacity ratio limit
Value
Type: System.Double
 The numeric value of the considered preference item.
 Multi-response case design
1 = Envelopes
2 = Step-by step
3 = Last step
4 = Envelopes - All
5 = Step-by step - All
 Country
1 = CEN Default
2 = United Kingdom
3 = Slovenia
4 = Bulgaria
5 = Norway
6 = Singapore
7 = Sweden
8 = Finland
9 = Denmark
10 = Portugal
11 = Germany
12 = Poland
13 = Ireland
 Combos equation
1 = Eq. 6.10
2 = Max of Eqs. 6.10a and 6.10b
 Reliability class
1 = Class 1
2 = Class 2
3 = Class 3
 Framing type
1 = DCH-MRF (Ductility Class High - Moment Frame)
2 = DCM-MRF (Ductility Class Medium - Moment Frame)
3 = DCL-MRF (Ductility Class Low - Moment Frame)
4 = DCH-CBF (Ductility Class High - Concentrically Braced Frame)
5 = DCM-CBF (Ductility Class Medium - Concentrically Braced Frame)
6 = DCL-CBF (Ductility Class Low - Concentrically Braced Frame)
7 = DCH-EBF (Ductility Class High - Eccentrically Braced Frame)
8 = DCM-EBF (Ductility Class Medium - Eccentrically Braced Frame)
9 = DCL-EBF (Ductility Class Low - Eccentrically Braced Frame)
10 = Inverted Pendulum Structure
11 = Secondary
 Consider second-order moments
0 = No
Any other value = Yes
 Partial factor for steel, GammaS
Value > 0
 PPartial factor for concrete, GammaC
Value > 0
 Partial factor for modulus of elasticity of concrete, GammaCE
Value > 0
 AlphaCC
Value > 0
 AlphaCT
Value > 0
 Ignore seismic code
0 = No
Any other value = Yes
 Pattern live load factor
Value > 0
 Demand/capacity ratio limit
Value > 0
Return Value
Type: Int32
 Returns zero if the item is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
   Dim ProgDet As Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set composite column design code
   ret = SapModel.DesignCompositeColumn.SetCode("Eurocode 4-2004")
'set overwrite item
   ret = SapModel.DesignCompositeColumn.Eurocode_4_2004.GetPreference(2, Value)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDCompColEurocode_4_2004 Interface
ETABSv1 Namespace